{"keras_version": "2.2.4-tf", "config": {"input_layers": [["input_16", 0, 0]], "name": "model_14", "output_layers": [["dense_51", 0, 0]], "layers": [{"config": {"sparse": false, "name": "input_16", "dtype": "float32", "batch_input_shape": [null, 32, 32, 3]}, "class_name": "InputLayer", "name": "input_16", "inbound_nodes": []}, {"config": {"dtype": "float32", "padding": "same", "name": "conv2d_111", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "relu", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "filters": 128, "trainable": true, "activity_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_111", "inbound_nodes": [[["input_16", 0, 0, {}]]]}, {"config": {"dtype": "float32", "padding": "same", "name": "conv2d_112", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "relu", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "filters": 128, "trainable": true, "activity_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_112", "inbound_nodes": [[["input_16", 0, 0, {}]]]}, {"config": {"dtype": "float32", "padding": "same", "name": "conv2d_113", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [7, 7], "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "relu", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "filters": 128, "trainable": true, "activity_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_113", "inbound_nodes": [[["input_16", 0, 0, {}]]]}, {"config": {"padding": "valid", "name": "max_pooling2d_88", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "pool_size": [1, 1], "dtype": "float32"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_88", "inbound_nodes": [[["conv2d_111", 0, 0, {}]]]}, {"config": {"padding": "valid", "name": "max_pooling2d_89", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "pool_size": [1, 1], "dtype": "float32"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_89", "inbound_nodes": [[["conv2d_112", 0, 0, {}]]]}, {"config": {"padding": "valid", "name": "max_pooling2d_90", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "pool_size": [1, 1], "dtype": "float32"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_90", "inbound_nodes": [[["conv2d_113", 0, 0, {}]]]}, {"config": {"axis": 1, "dtype": "float32", "name": "concatenate_18", "trainable": true}, "class_name": "Concatenate", "name": "concatenate_18", "inbound_nodes": [[["max_pooling2d_88", 0, 0, {}], ["max_pooling2d_89", 0, 0, {}], ["max_pooling2d_90", 0, 0, {}]]]}, {"config": {"name": "dropout_39", "noise_shape": null, "trainable": true, "rate": 0.25, "seed": null, "dtype": "float32"}, "class_name": "Dropout", "name": "dropout_39", "inbound_nodes": [[["concatenate_18", 0, 0, {}]]]}, {"config": {"dtype": "float32", "data_format": "channels_last", "name": "flatten_25", "trainable": true}, "class_name": "Flatten", "name": "flatten_25", "inbound_nodes": [[["dropout_39", 0, 0, {}]]]}, {"config": {"dtype": "float32", "activity_regularizer": null, "name": "dense_50", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "units": 64, "trainable": true, "activation": "relu"}, "class_name": "Dense", "name": "dense_50", "inbound_nodes": [[["flatten_25", 0, 0, {}]]]}, {"config": {"dtype": "float32", "activity_regularizer": null, "name": "dense_51", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "units": 10, "trainable": true, "activation": "softmax"}, "class_name": "Dense", "name": "dense_51", "inbound_nodes": [[["dense_50", 0, 0, {}]]]}]}, "class_name": "Model", "backend": "tensorflow"}