{"keras_version": "2.2.4-tf", "config": {"input_layers": [["input_11", 0, 0]], "name": "model_10", "output_layers": [["dense_41", 0, 0]], "layers": [{"config": {"sparse": false, "name": "input_11", "dtype": "float32", "batch_input_shape": [null, 32, 32, 3]}, "class_name": "InputLayer", "name": "input_11", "inbound_nodes": []}, {"config": {"dtype": "float32", "padding": "same", "name": "conv2d_81", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "relu", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "filters": 128, "trainable": true, "activity_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_81", "inbound_nodes": [[["input_11", 0, 0, {}]]]}, {"config": {"dtype": "float32", "padding": "same", "name": "conv2d_80", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "relu", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "strides": [2, 2], "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "filters": 128, "trainable": true, "activity_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_80", "inbound_nodes": [[["input_11", 0, 0, {}]]]}, {"config": {"padding": "valid", "name": "max_pooling2d_60", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "dtype": "float32"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_60", "inbound_nodes": [[["conv2d_81", 0, 0, {}]]]}, {"config": {"dtype": "float32", "padding": "same", "name": "conv2d_82", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [7, 7], "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "relu", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "strides": [2, 2], "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "filters": 128, "trainable": true, "activity_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_82", "inbound_nodes": [[["input_11", 0, 0, {}]]]}, {"config": {"axis": 1, "dtype": "float32", "name": "concatenate_10", "trainable": true}, "class_name": "Concatenate", "name": "concatenate_10", "inbound_nodes": [[["conv2d_80", 0, 0, {}], ["max_pooling2d_60", 0, 0, {}], ["conv2d_82", 0, 0, {}]]]}, {"config": {"name": "dropout_30", "noise_shape": null, "trainable": true, "rate": 0.25, "seed": null, "dtype": "float32"}, "class_name": "Dropout", "name": "dropout_30", "inbound_nodes": [[["concatenate_10", 0, 0, {}]]]}, {"config": {"dtype": "float32", "data_format": "channels_last", "name": "flatten_20", "trainable": true}, "class_name": "Flatten", "name": "flatten_20", "inbound_nodes": [[["dropout_30", 0, 0, {}]]]}, {"config": {"dtype": "float32", "activity_regularizer": null, "name": "dense_40", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "units": 64, "trainable": true, "activation": "relu"}, "class_name": "Dense", "name": "dense_40", "inbound_nodes": [[["flatten_20", 0, 0, {}]]]}, {"config": {"dtype": "float32", "activity_regularizer": null, "name": "dense_41", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "units": 10, "trainable": true, "activation": "softmax"}, "class_name": "Dense", "name": "dense_41", "inbound_nodes": [[["dense_40", 0, 0, {}]]]}]}, "class_name": "Model", "backend": "tensorflow"}