{"keras_version": "2.2.4-tf", "config": {"input_layers": [["input_17", 0, 0]], "name": "model_15", "output_layers": [["dense_53", 0, 0]], "layers": [{"config": {"sparse": false, "name": "input_17", "dtype": "float32", "batch_input_shape": [null, 32, 32, 3]}, "class_name": "InputLayer", "name": "input_17", "inbound_nodes": []}, {"config": {"dtype": "float32", "padding": "same", "name": "conv2d_114", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "relu", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "filters": 128, "trainable": true, "activity_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_114", "inbound_nodes": [[["input_17", 0, 0, {}]]]}, {"config": {"dtype": "float32", "padding": "same", "name": "conv2d_115", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "relu", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "filters": 128, "trainable": true, "activity_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_115", "inbound_nodes": [[["input_17", 0, 0, {}]]]}, {"config": {"dtype": "float32", "padding": "same", "name": "conv2d_116", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [7, 7], "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "relu", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "filters": 128, "trainable": true, "activity_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_116", "inbound_nodes": [[["input_17", 0, 0, {}]]]}, {"config": {"padding": "valid", "name": "max_pooling2d_91", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "pool_size": [1, 1], "dtype": "float32"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_91", "inbound_nodes": [[["conv2d_114", 0, 0, {}]]]}, {"config": {"padding": "valid", "name": "max_pooling2d_92", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "pool_size": [1, 1], "dtype": "float32"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_92", "inbound_nodes": [[["conv2d_115", 0, 0, {}]]]}, {"config": {"padding": "valid", "name": "max_pooling2d_93", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "pool_size": [1, 1], "dtype": "float32"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_93", "inbound_nodes": [[["conv2d_116", 0, 0, {}]]]}, {"config": {"axis": 1, "dtype": "float32", "name": "concatenate_19", "trainable": true}, "class_name": "Concatenate", "name": "concatenate_19", "inbound_nodes": [[["max_pooling2d_91", 0, 0, {}], ["max_pooling2d_92", 0, 0, {}], ["max_pooling2d_93", 0, 0, {}]]]}, {"config": {"name": "dropout_40", "noise_shape": null, "trainable": true, "rate": 0.25, "seed": null, "dtype": "float32"}, "class_name": "Dropout", "name": "dropout_40", "inbound_nodes": [[["concatenate_19", 0, 0, {}]]]}, {"config": {"dtype": "float32", "padding": "same", "name": "conv2d_117", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "relu", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "filters": 128, "trainable": true, "activity_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_117", "inbound_nodes": [[["dropout_40", 0, 0, {}]]]}, {"config": {"dtype": "float32", "padding": "same", "name": "conv2d_118", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "relu", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "filters": 128, "trainable": true, "activity_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_118", "inbound_nodes": [[["dropout_40", 0, 0, {}]]]}, {"config": {"dtype": "float32", "padding": "same", "name": "conv2d_119", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [7, 7], "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "relu", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "filters": 128, "trainable": true, "activity_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_119", "inbound_nodes": [[["dropout_40", 0, 0, {}]]]}, {"config": {"padding": "valid", "name": "max_pooling2d_94", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "dtype": "float32"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_94", "inbound_nodes": [[["conv2d_117", 0, 0, {}]]]}, {"config": {"padding": "valid", "name": "max_pooling2d_95", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "dtype": "float32"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_95", "inbound_nodes": [[["conv2d_118", 0, 0, {}]]]}, {"config": {"padding": "valid", "name": "max_pooling2d_96", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "dtype": "float32"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_96", "inbound_nodes": [[["conv2d_119", 0, 0, {}]]]}, {"config": {"axis": 1, "dtype": "float32", "name": "concatenate_20", "trainable": true}, "class_name": "Concatenate", "name": "concatenate_20", "inbound_nodes": [[["max_pooling2d_94", 0, 0, {}], ["max_pooling2d_95", 0, 0, {}], ["max_pooling2d_96", 0, 0, {}]]]}, {"config": {"name": "dropout_41", "noise_shape": null, "trainable": true, "rate": 0.25, "seed": null, "dtype": "float32"}, "class_name": "Dropout", "name": "dropout_41", "inbound_nodes": [[["concatenate_20", 0, 0, {}]]]}, {"config": {"dtype": "float32", "data_format": "channels_last", "name": "flatten_26", "trainable": true}, "class_name": "Flatten", "name": "flatten_26", "inbound_nodes": [[["dropout_41", 0, 0, {}]]]}, {"config": {"dtype": "float32", "activity_regularizer": null, "name": "dense_52", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "units": 64, "trainable": true, "activation": "relu"}, "class_name": "Dense", "name": "dense_52", "inbound_nodes": [[["flatten_26", 0, 0, {}]]]}, {"config": {"dtype": "float32", "activity_regularizer": null, "name": "dense_53", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "units": 10, "trainable": true, "activation": "softmax"}, "class_name": "Dense", "name": "dense_53", "inbound_nodes": [[["dense_52", 0, 0, {}]]]}]}, "class_name": "Model", "backend": "tensorflow"}